#ifndef HIDL_GENERATED_ANDROID_HARDWARE_KEYMASTER_GENERIC_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_KEYMASTER_GENERIC_TYPES_H

#include "../../../../../../libsuskmhal/util/km-tags-def.h"
#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>
#include <cstdint>

namespace android {
namespace hardware {
namespace keymaster {
namespace generic {

// Forward declaration for forward reference support:
enum class Constants : uint32_t;
enum class TagType : uint32_t;
enum class Tag : uint32_t;
enum class Algorithm : uint32_t;
enum class BlockMode : uint32_t;
enum class PaddingMode : uint32_t;
enum class Digest : uint32_t;
enum class EcCurve : uint32_t;
enum class KeyOrigin : uint32_t;
enum class KeyBlobUsageRequirements : uint32_t;
enum class KeyPurpose : uint32_t;
enum class ErrorCode : int32_t;
enum class KeyDerivationFunction : uint32_t;
enum class HardwareAuthenticatorType : uint32_t;
enum class SecurityLevel : uint32_t;
enum class KeyFormat : uint32_t;
struct KeyParameter;
struct KeyCharacteristics;
struct HardwareAuthToken;
struct HmacSharingParameters;
struct VerificationToken;

/**
 * Time in milliseconds since some arbitrary point in time.  Time must be monotonically increasing,
 * and a secure environment's notion of "current time" must not repeat until the Android device
 * reboots, or until at least 50 million years have elapsed (note that this requirement is satisfied
 * by setting the clock to zero during each boot, and then counting time accurately).
 */
typedef uint64_t Timestamp;

/**
 * A place to define any needed constants.
 */
enum class Constants : uint32_t {
    AUTH_TOKEN_MAC_LENGTH = 32u,
};

enum class TagType : uint32_t {
    /**
     * Invalid type, used to designate a tag as uninitialized.
     */
    INVALID = 0u /* 0 << 28 */,
    /**
     * Enumeration value.
     */
    ENUM = 268435456u /* 1 << 28 */,
    /**
     * Repeatable enumeration value.
     */
    ENUM_REP = 536870912u /* 2 << 28 */,
    /**
     * 32-bit unsigned integer.
     */
    UINT = 805306368u /* 3 << 28 */,
    /**
     * Repeatable 32-bit unsigned integer.
     */
    UINT_REP = 1073741824u /* 4 << 28 */,
    /**
     * 64-bit unsigned integer.
     */
    ULONG = 1342177280u /* 5 << 28 */,
    /**
     * 64-bit unsigned integer representing a date and time, in milliseconds since 1 Jan 1970.
     */
    DATE = 1610612736u /* 6 << 28 */,
    /**
     * Boolean.  If a tag with this type is present, the value is "true".  If absent, "false".
     */
    BOOL = 1879048192u /* 7 << 28 */,
    /**
     * Byte string containing an arbitrary-length integer, big-endian ordering.
     */
    BIGNUM = 2147483648u /* 8 << 28 */,
    /**
     * Byte string
     */
    BYTES = 2415919104u /* 9 << 28 */,
    /**
     * Repeatable 64-bit unsigned integer
     */
    ULONG_REP = 2684354560u /* 10 << 28 */,
};

enum class Tag : uint32_t {
    INVALID = 0u,

#define KM_DECL_TAG(name, type, tag_val, param_list_field, bound_enum, asn1_type, asn1_rep) \
    name = static_cast<uint32_t>(TagType::type) | static_cast<uint32_t>(tag_val),

    KM_TAG_LIST__

#undef KM_DECL_TAG
};

/**
 * Algorithms provided by IKeymasterDevice implementations.
 */
enum class Algorithm : uint32_t {
    /**
     * Asymmetric algorithms.
     */
    RSA = 1u,
    EC = 3u,
    /**
     * Block cipher algorithms
     */
    AES = 32u,
    TRIPLE_DES = 33u,
    /**
     * MAC algorithms
     */
    HMAC = 128u,
};

/**
 * Symmetric block cipher modes provided by keymaster implementations.
 */
enum class BlockMode : uint32_t {
    /*
     * Unauthenticated modes, usable only for encryption/decryption and not generally recommended
     * except for compatibility with existing other protocols.
     */
    ECB = 1u,
    CBC = 2u,
    CTR = 3u,
    /*
     * Authenticated modes, usable for encryption/decryption and signing/verification.  Recommended
     * over unauthenticated modes for all purposes.
     */
    GCM = 32u,
};

/**
 * Padding modes that may be applied to plaintext for encryption operations.  This list includes
 * padding modes for both symmetric and asymmetric algorithms.  Note that implementations should not
 * provide all possible combinations of algorithm and padding, only the
 * cryptographically-appropriate pairs.
 */
enum class PaddingMode : uint32_t {
    NONE = 1u,
    /*
     * deprecated
     */
    RSA_OAEP = 2u,
    RSA_PSS = 3u,
    RSA_PKCS1_1_5_ENCRYPT = 4u,
    RSA_PKCS1_1_5_SIGN = 5u,
    PKCS7 = 64u,
};

/**
 * Digests provided by keymaster implementations.
 */
enum class Digest : uint32_t {
    NONE = 0u,
    MD5 = 1u,
    SHA1 = 2u,
    SHA_2_224 = 3u,
    SHA_2_256 = 4u,
    SHA_2_384 = 5u,
    SHA_2_512 = 6u,
};

/**
 * Supported EC curves, used in ECDSA
 */
enum class EcCurve : uint32_t {
    P_224 = 0u,
    P_256 = 1u,
    P_384 = 2u,
    P_521 = 3u,
};

/**
 * The origin of a key (or pair), i.e. where it was generated.  Note that ORIGIN can be found in
 * either the hardware-enforced or software-enforced list for a key, indicating whether the key is
 * hardware or software-based.  Specifically, a key with GENERATED in the hardware-enforced list
 * must be guaranteed never to have existed outide the secure hardware.
 */
enum class KeyOrigin : uint32_t {
    /**
     * Generated in keymaster.  Should not exist outside the TEE.
     */
    GENERATED = 0u,
    /**
     * Derived inside keymaster.  Likely exists off-device.
     */
    DERIVED = 1u,
    /**
     * Imported into keymaster.  Existed as cleartext in Android.
     */
    IMPORTED = 2u,
    /**
     * Keymaster did not record origin.  This value can only be seen on keys in a keymaster0
     * implementation.  The keymaster0 adapter uses this value to document the fact that it is
     * unkown whether the key was generated inside or imported into keymaster.
     */
    UNKNOWN = 3u,
    /**
     * Securely imported into Keymaster.  Was created elsewhere, and passed securely through Android
     * to secure hardware.
     */
    SECURELY_IMPORTED = 4u,
};

/**
 * Usability requirements of key blobs.  This defines what system functionality must be available
 * for the key to function.  For example, key "blobs" which are actually handles referencing
 * encrypted key material stored in the file system cannot be used until the file system is
 * available, and should have BLOB_REQUIRES_FILE_SYSTEM.
 */
enum class KeyBlobUsageRequirements : uint32_t {
    STANDALONE = 0u,
    REQUIRES_FILE_SYSTEM = 1u,
};

/**
 * Possible purposes of a key (or pair).
 */
enum class KeyPurpose : uint32_t {
    ENCRYPT = 0u,
    /*
     * Usable with RSA, EC and AES keys.
     */
    DECRYPT = 1u,
    /*
     * Usable with RSA, EC and AES keys.
     */
    SIGN = 2u,
    /*
     * Usable with RSA, EC and HMAC keys.
     */
    VERIFY = 3u,
    /*
     * Usable with RSA, EC and HMAC keys.
     *
     *
     * 4 is reserved
     */
    WRAP_KEY = 5u,
};

/**
 * Keymaster error codes.
 */
enum class ErrorCode : int32_t {
    OK = 0,
    ROOT_OF_TRUST_ALREADY_SET = -1 /* -1 */,
    UNSUPPORTED_PURPOSE = -2 /* -2 */,
    INCOMPATIBLE_PURPOSE = -3 /* -3 */,
    UNSUPPORTED_ALGORITHM = -4 /* -4 */,
    INCOMPATIBLE_ALGORITHM = -5 /* -5 */,
    UNSUPPORTED_KEY_SIZE = -6 /* -6 */,
    UNSUPPORTED_BLOCK_MODE = -7 /* -7 */,
    INCOMPATIBLE_BLOCK_MODE = -8 /* -8 */,
    UNSUPPORTED_MAC_LENGTH = -9 /* -9 */,
    UNSUPPORTED_PADDING_MODE = -10 /* -10 */,
    INCOMPATIBLE_PADDING_MODE = -11 /* -11 */,
    UNSUPPORTED_DIGEST = -12 /* -12 */,
    INCOMPATIBLE_DIGEST = -13 /* -13 */,
    INVALID_EXPIRATION_TIME = -14 /* -14 */,
    INVALID_USER_ID = -15 /* -15 */,
    INVALID_AUTHORIZATION_TIMEOUT = -16 /* -16 */,
    UNSUPPORTED_KEY_FORMAT = -17 /* -17 */,
    INCOMPATIBLE_KEY_FORMAT = -18 /* -18 */,
    UNSUPPORTED_KEY_ENCRYPTION_ALGORITHM = -19 /* -19 */,
    /**
     * For PKCS8 & PKCS12
     */
    UNSUPPORTED_KEY_VERIFICATION_ALGORITHM = -20 /* -20 */,
    /**
     * For PKCS8 & PKCS12
     */
    INVALID_INPUT_LENGTH = -21 /* -21 */,
    KEY_EXPORT_OPTIONS_INVALID = -22 /* -22 */,
    DELEGATION_NOT_ALLOWED = -23 /* -23 */,
    KEY_NOT_YET_VALID = -24 /* -24 */,
    KEY_EXPIRED = -25 /* -25 */,
    KEY_USER_NOT_AUTHENTICATED = -26 /* -26 */,
    OUTPUT_PARAMETER_NULL = -27 /* -27 */,
    INVALID_OPERATION_HANDLE = -28 /* -28 */,
    INSUFFICIENT_BUFFER_SPACE = -29 /* -29 */,
    VERIFICATION_FAILED = -30 /* -30 */,
    TOO_MANY_OPERATIONS = -31 /* -31 */,
    UNEXPECTED_NULL_POINTER = -32 /* -32 */,
    INVALID_KEY_BLOB = -33 /* -33 */,
    IMPORTED_KEY_NOT_ENCRYPTED = -34 /* -34 */,
    IMPORTED_KEY_DECRYPTION_FAILED = -35 /* -35 */,
    IMPORTED_KEY_NOT_SIGNED = -36 /* -36 */,
    IMPORTED_KEY_VERIFICATION_FAILED = -37 /* -37 */,
    INVALID_ARGUMENT = -38 /* -38 */,
    UNSUPPORTED_TAG = -39 /* -39 */,
    INVALID_TAG = -40 /* -40 */,
    MEMORY_ALLOCATION_FAILED = -41 /* -41 */,
    IMPORT_PARAMETER_MISMATCH = -44 /* -44 */,
    SECURE_HW_ACCESS_DENIED = -45 /* -45 */,
    OPERATION_CANCELLED = -46 /* -46 */,
    CONCURRENT_ACCESS_CONFLICT = -47 /* -47 */,
    SECURE_HW_BUSY = -48 /* -48 */,
    SECURE_HW_COMMUNICATION_FAILED = -49 /* -49 */,
    UNSUPPORTED_EC_FIELD = -50 /* -50 */,
    MISSING_NONCE = -51 /* -51 */,
    INVALID_NONCE = -52 /* -52 */,
    MISSING_MAC_LENGTH = -53 /* -53 */,
    KEY_RATE_LIMIT_EXCEEDED = -54 /* -54 */,
    CALLER_NONCE_PROHIBITED = -55 /* -55 */,
    KEY_MAX_OPS_EXCEEDED = -56 /* -56 */,
    INVALID_MAC_LENGTH = -57 /* -57 */,
    MISSING_MIN_MAC_LENGTH = -58 /* -58 */,
    UNSUPPORTED_MIN_MAC_LENGTH = -59 /* -59 */,
    UNSUPPORTED_KDF = -60 /* -60 */,
    UNSUPPORTED_EC_CURVE = -61 /* -61 */,
    KEY_REQUIRES_UPGRADE = -62 /* -62 */,
    ATTESTATION_CHALLENGE_MISSING = -63 /* -63 */,
    KEYMASTER_NOT_CONFIGURED = -64 /* -64 */,
    ATTESTATION_APPLICATION_ID_MISSING = -65 /* -65 */,
    CANNOT_ATTEST_IDS = -66 /* -66 */,
    ROLLBACK_RESISTANCE_UNAVAILABLE = -67 /* -67 */,
    HARDWARE_TYPE_UNAVAILABLE = -68 /* -68 */,
    PROOF_OF_PRESENCE_REQUIRED = -69 /* -69 */,
    CONCURRENT_PROOF_OF_PRESENCE_REQUESTED = -70 /* -70 */,
    NO_USER_CONFIRMATION = -71 /* -71 */,
    DEVICE_LOCKED = -72 /* -72 */,
    UNIMPLEMENTED = -100 /* -100 */,
    VERSION_MISMATCH = -101 /* -101 */,
    UNKNOWN_ERROR = -1000 /* -1000 */,
};

/**
 * Key derivation functions, mostly used in ECIES.
 */
enum class KeyDerivationFunction : uint32_t {
    /**
     * Do not apply a key derivation function; use the raw agreed key
     */
    NONE = 0u,
    /**
     * HKDF defined in RFC 5869 with SHA256
     */
    RFC5869_SHA256 = 1u,
    /**
     * KDF1 defined in ISO 18033-2 with SHA1
     */
    ISO18033_2_KDF1_SHA1 = 2u,
    /**
     * KDF1 defined in ISO 18033-2 with SHA256
     */
    ISO18033_2_KDF1_SHA256 = 3u,
    /**
     * KDF2 defined in ISO 18033-2 with SHA1
     */
    ISO18033_2_KDF2_SHA1 = 4u,
    /**
     * KDF2 defined in ISO 18033-2 with SHA256
     */
    ISO18033_2_KDF2_SHA256 = 5u,
};

/**
 * Hardware authentication type, used by HardwareAuthTokens to specify the mechanism used to
 * authentiate the user, and in KeyCharacteristics to specify the allowable mechanisms for
 * authenticating to activate a key.
 */
enum class HardwareAuthenticatorType : uint32_t {
    NONE = 0u,
    PASSWORD = 1u /* 1 << 0 */,
    FINGERPRINT = 2u /* 1 << 1 */,
    ANY = 4294967295u /* 0xFFFFFFFF */,
};

/**
 * Device security levels.
 */
enum class SecurityLevel : uint32_t {
    SOFTWARE = 0u,
    TRUSTED_ENVIRONMENT = 1u,
    /**
     * STRONGBOX specifies that the secure hardware satisfies the requirements specified in CDD
     * 9.11.2.
     */
    STRONGBOX = 2u,
};

/**
 * Formats for key import and export.
 */
enum class KeyFormat : uint32_t {
    /**
     * X.509 certificate format, for public key export.
     */
    X509 = 0u,
    /**
     * PCKS#8 format, asymmetric key pair import.
     */
    PKCS8 = 1u,
    /**
     * Raw bytes, for symmetric key import.
     */
    RAW = 3u,
};

struct KeyParameter final {
    // Forward declaration for forward reference support:
    union IntegerParams;

    union IntegerParams final {
        /*
         * Enum types
         */
        ::android::hardware::keymaster::generic::Algorithm algorithm __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::BlockMode blockMode __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::PaddingMode paddingMode __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::Digest digest __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::EcCurve ecCurve __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::KeyOrigin origin __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::KeyBlobUsageRequirements keyBlobUsageRequirements __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::KeyPurpose purpose __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::KeyDerivationFunction keyDerivationFunction __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::HardwareAuthenticatorType hardwareAuthenticatorType __attribute__ ((aligned(4)));
        ::android::hardware::keymaster::generic::SecurityLevel hardwareType __attribute__ ((aligned(4)));
        /*
         * Other types
         */
        bool boolValue __attribute__ ((aligned(1)));
        uint32_t integer __attribute__ ((aligned(4)));
        uint64_t longInteger __attribute__ ((aligned(8)));
        uint64_t dateTime __attribute__ ((aligned(8)));
    };


    /**
     * Discriminates the union/blob field used.  The blob cannot be placed in the union, but only
     * one of "f" and "blob" may ever be used at a time.
     */
    ::android::hardware::keymaster::generic::Tag tag __attribute__ ((aligned(4)));
    ::android::hardware::keymaster::generic::KeyParameter::IntegerParams f __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<uint8_t> blob __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::keymaster::generic::KeyParameter, tag) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::KeyParameter, f) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::KeyParameter, blob) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::keymaster::generic::KeyParameter) == 32, "wrong size");
static_assert(__alignof(::android::hardware::keymaster::generic::KeyParameter) == 8, "wrong alignment");

/**
 * KeyCharacteristics defines the attributes of a key, including cryptographic parameters, and usage
 * restrictions.  It consits of two vectors of KeyParameters, one for "softwareEnforced" attributes
 * and one for "hardwareEnforced" attributes.
 *
 * KeyCharacteristics objects are returned by generateKey, importKey, importWrappedKey and
 * getKeyCharacteristics.  The IKeymasterDevice secure environment is responsible for allocating the
 * parameters, all of which are Tags with associated values, to the correct vector.  The
 * hardwareEnforced vector must contain only those attributes which are enforced by secure hardware.
 * All others should be in the softwareEnforced vector.  See the definitions of individual Tag enums
 * for specification of which must be hardware-enforced, which may be software-enforced and which
 * must never appear in KeyCharacteristics.
 */
struct KeyCharacteristics final {
    ::android::hardware::hidl_vec<::android::hardware::keymaster::generic::KeyParameter> softwareEnforced __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::keymaster::generic::KeyParameter> hardwareEnforced __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::keymaster::generic::KeyCharacteristics, softwareEnforced) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::KeyCharacteristics, hardwareEnforced) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::keymaster::generic::KeyCharacteristics) == 32, "wrong size");
static_assert(__alignof(::android::hardware::keymaster::generic::KeyCharacteristics) == 8, "wrong alignment");

/**
 * HardwareAuthToken is used to prove successful user authentication, to unlock the use of a key.
 *
 * HardwareAuthTokens are produced by other secure environment applications, notably GateKeeper and
 * Fingerprint, in response to successful user authentication events.  These tokens are passed to
 * begin(), update(), and finish() to prove that authentication occurred.  See those methods for
 * more details.  It is up to the caller to determine which of the generated auth tokens is
 * appropriate for a given key operation.
 */
struct HardwareAuthToken final {
    /**
     * challenge is a value that's used to enable authentication tokens to authorize specific
     * events.  The primary use case for challenge is to authorize an IKeymasterDevice cryptographic
     * operation, for keys that require authentication per operation. See begin() for details.
     */
    uint64_t challenge __attribute__ ((aligned(8)));
    /**
     *  userId is the a "secure" user ID.  It is not related to any Android user ID or UID, but is
     *  created in the Gatekeeper application in the secure environment.
     */
    uint64_t userId __attribute__ ((aligned(8)));
    /**
     *  authenticatorId is the a "secure" user ID.  It is not related to any Android user ID or UID,
     *  but is created in an authentication application in the secure environment, such as the
     *  Fingerprint application.
     */
    uint64_t authenticatorId __attribute__ ((aligned(8)));
    /**
     * authenticatorType describes the type of authentication that took place, e.g. password or
     * fingerprint.
     */
    ::android::hardware::keymaster::generic::HardwareAuthenticatorType authenticatorType __attribute__ ((aligned(4)));
    /**
     * timestamp indicates when the user authentication took place, in milliseconds since some
     * starting point (generally the most recent device boot) which all of the applications within
     * one secure environment must agree upon.  This timestamp is used to determine whether or not
     * the authentication occurred recently enough to unlock a key (see Tag::AUTH_TIMEOUT).
     */
    uint64_t timestamp __attribute__ ((aligned(8)));
    /**
     * MACs are computed with a backward-compatible method, used by Keymaster 3.0, Gatekeeper 1.0
     * and Fingerprint 1.0, as well as pre-treble HALs.
     *
     * The MAC is Constants::AUTH_TOKEN_MAC_LENGTH bytes in length and is computed as follows:
     *
     *     HMAC_SHA256(
     *         H, 0 || challenge || user_id || authenticator_id || authenticator_type || timestamp)
     *
     * where ``||'' represents concatenation, the leading zero is a single byte, and all integers
     * are represented as unsigned values, the full width of the type.  The challenge, userId and
     * authenticatorId values are in machine order, but authenticatorType and timestamp are in
     * network order (big-endian).  This odd construction is compatible with the hw_auth_token_t
     * structure,
     *
     * Note that mac is a vec rather than an array, not because it's actually variable-length but
     * because it could be empty.  As documented in the IKeymasterDevice::begin,
     * IKeymasterDevice::update and IKeymasterDevice::finish doc comments, an empty mac indicates
     * that this auth token is empty.
     */
    ::android::hardware::hidl_vec<uint8_t> mac __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::keymaster::generic::HardwareAuthToken, challenge) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::HardwareAuthToken, userId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::HardwareAuthToken, authenticatorId) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::HardwareAuthToken, authenticatorType) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::HardwareAuthToken, timestamp) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::HardwareAuthToken, mac) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::keymaster::generic::HardwareAuthToken) == 56, "wrong size");
static_assert(__alignof(::android::hardware::keymaster::generic::HardwareAuthToken) == 8, "wrong alignment");

typedef uint64_t OperationHandle;

/**
 * HmacSharingParameters holds the data used in the process of establishing a shared HMAC key
 * between multiple Keymaster instances.  Sharing parameters are returned in this struct by
 * getHmacSharingParameters() and send to computeSharedHmac().  See the named methods in IKeymaster
 * for details of usage.
 */
struct HmacSharingParameters final {
    /**
     * Either empty or contains a persistent value that is associated with the pre-shared HMAC
     * agreement key (see documentation of computeSharedHmac in @4.0::IKeymaster).  It is either
     * empty or 32 bytes in length.
     */
    ::android::hardware::hidl_vec<uint8_t> seed __attribute__ ((aligned(8)));
    /**
     * A 32-byte value which is guaranteed to be different each time
     * getHmacSharingParameters() is called.  Probabilistic uniqueness (i.e. random) is acceptable,
     * though a stronger uniqueness guarantee (e.g. counter) is recommended where possible.
     */
    ::android::hardware::hidl_array<uint8_t, 32> nonce __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::keymaster::generic::HmacSharingParameters, seed) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::HmacSharingParameters, nonce) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::keymaster::generic::HmacSharingParameters) == 48, "wrong size");
static_assert(__alignof(::android::hardware::keymaster::generic::HmacSharingParameters) == 8, "wrong alignment");

/**
 * VerificationToken enables one Keymaster instance to validate authorizations for another.  See
 * verifyAuthorizations() in IKeymaster for details.
 */
struct VerificationToken final {
    /**
     * The operation handle, used to ensure freshness.
     */
    uint64_t challenge __attribute__ ((aligned(8)));
    /**
     * The current time of the secure environment that generates the VerificationToken.  This can be
     * checked against auth tokens generated by the same secure environment, which avoids needing to
     * synchronize clocks.
     */
    uint64_t timestamp __attribute__ ((aligned(8)));
    /**
     * A list of the parameters verified.  Empty if the only parameters verified are time-related.
     * In that case the timestamp is the payload.
     */
    ::android::hardware::hidl_vec<::android::hardware::keymaster::generic::KeyParameter> parametersVerified __attribute__ ((aligned(8)));
    /**
     * SecurityLevel of the secure environment that generated the token.
     */
    ::android::hardware::keymaster::generic::SecurityLevel securityLevel __attribute__ ((aligned(4)));
    /**
     * 32-byte HMAC-SHA256 of the above values, computed as:
     *
     *    HMAC(H,
     *         "Auth Verification" || challenge || timestamp || securityLevel || parametersVerified)
     *
     * where:
     *
     *   ``HMAC'' is the shared HMAC key (see computeSharedHmac() in IKeymaster).
     *
     *   ``||'' represents concatenation
     *
     * The representation of challenge and timestamp is as 64-bit unsigned integers in big-endian
     * order.  securityLevel is represented as a 32-bit unsigned integer in big-endian order.
     *
     * If parametersVerified is non-empty, the representation of parametersVerified is an ASN.1 DER
     * encoded representation of the values.  The ASN.1 schema used is the AuthorizationList schema
     * from the Keystore attestation documentation.  If parametersVerified is empty, it is simply
     * omitted from the HMAC computation.
     */
    ::android::hardware::hidl_vec<uint8_t> mac __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::keymaster::generic::VerificationToken, challenge) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::VerificationToken, timestamp) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::VerificationToken, parametersVerified) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::VerificationToken, securityLevel) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::keymaster::generic::VerificationToken, mac) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::keymaster::generic::VerificationToken) == 56, "wrong size");
static_assert(__alignof(::android::hardware::keymaster::generic::VerificationToken) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint32_t o);
static inline std::string toString(::android::hardware::keymaster::generic::Constants o);
static inline void PrintTo(::android::hardware::keymaster::generic::Constants o, ::std::ostream* os);
constexpr uint32_t operator|(const ::android::hardware::keymaster::generic::Constants lhs, const ::android::hardware::keymaster::generic::Constants rhs) {
    return static_cast<uint32_t>(static_cast<uint32_t>(lhs) | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const uint32_t lhs, const ::android::hardware::keymaster::generic::Constants rhs) {
    return static_cast<uint32_t>(lhs | static_cast<uint32_t>(rhs));
}
constexpr uint32_t operator|(const ::android::hardware::keymaster::generic::Constants lhs, const uint32_t rhs) {
